PX4/PX4-Autopilot/nuttx/arch/mips/src/pic32mx/pic32mx-usbdev.c
          (void)pic32mx_epstall(&ep0->ep, false);
        }
    }
}

/****************************************************************************
 * Name: pic32mx_ep0in
 ****************************************************************************/

static void pic32mx_ep0in(struct pic32mx_usbdev_s *priv)
{
  volatile struct usbotg_bdtentry_s *bdt;
  struct pic32mx_ep_s *ep0 = &priv->eplist[EP0];
  uint16_t status;
  int ret;

  /* There is no longer anything in the EP0 TX packet memory */

  ep0->txbusy = false;
  bdt         = ep0->bdtin;

  /* Switch to the next ping pong buffer */

  status  = bdt->status;
#ifdef CONFIG_USB_PINGPONG
  status ^= USB_NEXT_PINGPONG;
#endif

  /* Are we processing the completion of one packet of an outgoing request
   * from the class driver?
   */

  if (priv->ctrlstate == CTRLSTATE_WRREQUEST)
    {
      /* Handle the next queue IN transfer */

      ret = pic32mx_wrrequest(priv, &priv->eplist[EP0]);
      if (ret == OK)
        {
          /* Is there another IN transfer in-flight? */

          if (priv->ctrlstate == CTRLSTATE_WAITSETUP)
            {
              /* No... Prepare for the next SETUP transfer */

              pic32mx_ep0nextsetup(priv);
            }
        }
    }

  /* No.. Are we processing the completion of a status response? */

  else if (priv->ctrlstate == CTRLSTATE_WAITSETUP)
    {
      /* Look at the saved SETUP command.  Was it a SET ADDRESS request?
       * If so, then now is the time to set the address.
       */

      if (priv->devstate == DEVSTATE_ADDRPENDING)
        {
          uint16_t addr = GETUINT16(priv->ctrl.value);

          /* This should be the equivalent state */

          DEBUGASSERT(priv->ctrl.req == USB_REQ_SETADDRESS &&
                     (priv->ctrl.type & REQRECIPIENT_MASK) ==
                     (USB_REQ_TYPE_STANDARD | USB_REQ_RECIPIENT_DEVICE));

          pic32mx_putreg(addr, PIC32MX_USB_ADDR);
          if (addr > 0)
            {
              priv->devstate = DEVSTATE_ADDRESS;
            }
          else
            {
              priv->devstate = DEVSTATE_DEFAULT;
            }
        }

      /* Prepare for the next SETUP transfer */

      pic32mx_ep0nextsetup(priv);
    }

  /* No other state is expected in this context */

  else
    {
      usbtrace(TRACE_DEVERROR(PIC32MX_TRACEERR_INVALIDSTATE), priv->ctrlstate);
      priv->ctrlstate = CTRLSTATE_STALLED;
    }
}

/****************************************************************************
 * Name: pic32mx_ep0out
 ****************************************************************************/

static void pic32mx_ep0out(struct pic32mx_usbdev_s *priv)
{
  struct pic32mx_ep_s *ep0 = &priv->eplist[EP0];
  uint16_t status;

  switch (priv->ctrlstate)
    {
      case CTRLSTATE_RDREQUEST:  /* Read request in progress */

        /* Process the next read request for EP0 */

        pic32mx_rdcomplete(priv, ep0);

        /* Was this the end of the OUT transfer? */

        if (priv->ctrlstate == CTRLSTATE_WAITSETUP)
          {
            /* Prepare EP0 OUT for the next SETUP transaction. */

            status = ep0->bdtout->status & ~(USB_BDT_BYTECOUNT_MASK|USB_BDT_DATA01);
            ep0->bdtout->status = status;

            ep0->bdtout->addr = (uint8_t *)PHYS_ADDR(&priv->ctrl);
            status |= (USB_SIZEOF_CTRLREQ << USB_BDT_BYTECOUNT_SHIFT);
            status |= (USB_BDT_DATA0 | USB_BDT_DTS | USB_BDT_BSTALL);

            /* Set BSTALL in case the host tries to send more data than
             * it claims it was going to send.
             */

            status |= (USB_BDT_BSTALL | USB_BDT_UOWN);

            /* Then give the BDT to the USB */

            regdbg("EP0 BDT OUT {%08x, %08x}\n", status, ep0->bdtout->addr);

            ep0->bdtout->status = status;
          }
        break;

      case CTRLSTATE_WAITSETUP:      /* No transfer in progress, waiting for setup */
        {
          /* In this case the last OUT transaction must have been a status
           * stage of a CTRLSTATE_WRREQUEST
           */

          /* Prepare EP0 OUT for the next SETUP transaction.  However,
           * EP0 may have already been prepared if ping-pong buffering
           * was enabled on EP0 OUT, and the last control transfer was
           * of direction: device to host, see pic32mx_ep0done().  If
           * it was already prepared, we do not want to do anything to
           * the buffer descriptor table (BDT).
           */

           pic32mx_ep0nextsetup(priv);

#ifdef CONFIG_USB_PINGPONG
          if (!priv->ep0ready)
#endif
            {
              status = ep0->bdtout->status & ~(USB_BDT_BYTECOUNT_MASK|USB_BDT_DATA01);
              ep0->bdtout->status = status;

              ep0->bdtout->addr = (uint8_t *)PHYS_ADDR(&priv->ctrl);
              status |= (USB_SIZEOF_CTRLREQ << USB_BDT_BYTECOUNT_SHIFT);
              status |= (USB_BDT_UOWN | USB_BDT_DATA0 | USB_BDT_DTS | USB_BDT_BSTALL);

              /* Then give the BDT to the USB */

              regdbg("EP0 BDT OUT {%08x, %08x}\n", status, ep0->bdtout->addr);

              ep0->bdtout->status = status;
            }

#ifdef CONFIG_USB_PINGPONG
            priv->ep0ready = 0;
#endif
        }
        break;

      default:
        {
          /* Unexpected state OR host aborted the OUT transfer before it
           * completed, STALL the endpoint in either case
           */

          usbtrace(TRACE_DEVERROR(PIC32MX_TRACEERR_INVALIDSTATE), priv->ctrlstate);
          priv->ctrlstate = CTRLSTATE_STALLED;
        }
        break;
    }
}

/****************************************************************************
 * Name: pic32mx_ep0transfer
 ****************************************************************************/

static void pic32mx_ep0transfer(struct pic32mx_usbdev_s *priv, uint16_t status)
{
  volatile struct usbotg_bdtentry_s *bdt;

  /* The following information is available in the tatus register :
   *
   * ENDPT - The 4 bit endpoint number that cause the interrupt.
   * DIR   - The direction of the endpoint.
   * PPBI  - The ping-pong buffer used in the transaction.
   */

